# PANDAS

In [4]:
import pandas as pd
#series
ser = pd.Series(['a','b','c',3])
#index에 숫자 할당

ser

0    a
1    b
2    c
3    3
dtype: object

In [8]:
ser.values

array(['a', 'b', 'c', 3], dtype=object)

In [9]:
ser.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
# 인덱스의 인자 값 지정

ser2 = pd.Series(['a', 'b', 'c', 3], index=['i','j','k','h'])
ser2

i    a
j    b
k    c
h    3
dtype: object

In [10]:
# index <지정
ser2.index = ['Jhon', 'Steve', 'Jack', 'Bob']
ser2

Jhon     a
Steve    b
Jack     c
Bob      3
dtype: object

In [11]:
#index 값 확인
ser2.index

Index(['Jhon', 'Steve', 'Jack', 'Bob'], dtype='object')

In [12]:
Country_PhoneNumber = {'Korea': 82, 'America': 1, 'Swiss': 41, 'Italy': 39, 'Japan': 81, 'China': 86, 'Rusia': 7}
ser3 = pd.Series(Country_PhoneNumber)
ser3

Korea      82
America     1
Swiss      41
Italy      39
Japan      81
China      86
Rusia       7
dtype: int64

In [13]:
#slice
ser3['Korea']

82

In [14]:
ser3['Italy':]

Italy    39
Japan    81
China    86
Rusia     7
dtype: int64

In [15]:
ser3.name = 'Country_PhoneNumber'
ser3.index.name = 'Country_Name'
ser3

Country_Name
Korea      82
America     1
Swiss      41
Italy      39
Japan      81
China      86
Rusia       7
Name: Country_PhoneNumber, dtype: int64


# data Frame

In [16]:
data = {'Region' : ['Korea', 'America', 'Chaina', 'Canada', 'Italy'],
        'Sales' : [300, 200, 500, 150, 50],
        'Amount' : [90, 80, 100, 30, 10],
        'Employee' : [20, 10, 30, 5, 3]
        }
s = pd.Series(data)
s

Region      [Korea, America, Chaina, Canada, Italy]
Sales                      [300, 200, 500, 150, 50]
Amount                        [90, 80, 100, 30, 10]
Employee                         [20, 10, 30, 5, 3]
dtype: object

In [17]:
s = pd.DataFrame(data)
s

    Region  Sales  Amount  Employee
0    Korea    300      90        20
1  America    200      80        10
2   Chaina    500     100        30
3   Canada    150      30         5
4    Italy     50      10         3

In [21]:
s.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [22]:
s.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [23]:
s.index=['one','two','three','four','five']
s.columns = ['a','b','c','d']
s

             a    b    c   d
one      Korea  300   90  20
two    America  200   80  10
three   Chaina  500  100  30
four    Canada  150   30   5
five     Italy   50   10   3